{"format": "graph-model", "generatedBy": "1.7.0", "convertedBy": "TensorFlow.js Converter v3.7.0", "signature": {"inputs": {"latent_var": {"name": "latent_var:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}}, "outputs": {"reconstructed": {"name": "add:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "decoder/Conv2d_3/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_2/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_1/mul/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Fc_1/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Fc_1/biases", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4096"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/Upsample_1/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/Upsample_2/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/Upsample_3/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "decoder/Upsample_4/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "latent_var", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_2/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_4/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "decoder/Fc_1/BiasAdd", "op": "_FusedMatMul", "input": ["latent_var", "decoder/Fc_1/weights", "decoder/Fc_1/biases"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "decoder/Reshape", "op": "Reshape", "input": ["decoder/Fc_1/BiasAdd", "decoder/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "decoder/Upsample_1", "op": "ResizeNearestNeighbor", "input": ["decoder/Reshape", "decoder/Upsample_1/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_1/BatchNorm/FusedBatchNorm", "op": "_FusedConv2D", "input": ["decoder/Upsample_1", "decoder/Conv2d_1/Conv2D_weights", "decoder/Conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "decoder/Conv2d_1/mul", "op": "Mul", "input": ["decoder/Conv2d_1/mul/x", "decoder/Conv2d_1/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_1/Maximum", "op": "Maximum", "input": ["decoder/Conv2d_1/mul", "decoder/Conv2d_1/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Upsample_2", "op": "ResizeNearestNeighbor", "input": ["decoder/Conv2d_1/Maximum", "decoder/Upsample_2/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_2/BatchNorm/FusedBatchNorm", "op": "_FusedConv2D", "input": ["decoder/Upsample_2", "decoder/Conv2d_2/Conv2D_weights", "decoder/Conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "decoder/Conv2d_2/mul", "op": "Mul", "input": ["decoder/Conv2d_2/mul/x", "decoder/Conv2d_2/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_2/Maximum", "op": "Maximum", "input": ["decoder/Conv2d_2/mul", "decoder/Conv2d_2/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Upsample_3", "op": "ResizeNearestNeighbor", "input": ["decoder/Conv2d_2/Maximum", "decoder/Upsample_3/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_3/BatchNorm/FusedBatchNorm", "op": "_FusedConv2D", "input": ["decoder/Upsample_3", "decoder/Conv2d_3/Conv2D_weights", "decoder/Conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "decoder/Conv2d_3/mul", "op": "Mul", "input": ["decoder/Conv2d_3/mul/x", "decoder/Conv2d_3/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_3/Maximum", "op": "Maximum", "input": ["decoder/Conv2d_3/mul", "decoder/Conv2d_3/BatchNorm/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Upsample_4", "op": "ResizeNearestNeighbor", "input": ["decoder/Conv2d_3/Maximum", "decoder/Upsample_4/size"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "decoder/Conv2d_4/BatchNorm/FusedBatchNorm", "op": "_FusedConv2D", "input": ["decoder/Upsample_4", "decoder/Conv2d_4/Conv2D_weights", "decoder/Conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "mul", "op": "Mul", "input": ["decoder/Conv2d_4/BatchNorm/FusedBatchNorm", "mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "add", "op": "Add", "input": ["mul", "add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 716}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "decoder/Conv2d_3/mul/x", "shape": [], "dtype": "float32"}, {"name": "decoder/Conv2d_2/mul/x", "shape": [], "dtype": "float32"}, {"name": "decoder/Conv2d_1/mul/x", "shape": [], "dtype": "float32"}, {"name": "decoder/Fc_1/weights", "shape": [100, 4096], "dtype": "float32"}, {"name": "decoder/Fc_1/biases", "shape": [4096], "dtype": "float32"}, {"name": "decoder/Reshape/shape", "shape": [4], "dtype": "int32"}, {"name": "decoder/Upsample_1/size", "shape": [2], "dtype": "int32"}, {"name": "decoder/Upsample_2/size", "shape": [2], "dtype": "int32"}, {"name": "decoder/Upsample_3/size", "shape": [2], "dtype": "int32"}, {"name": "decoder/Upsample_4/size", "shape": [2], "dtype": "int32"}, {"name": "mul/y", "shape": [3], "dtype": "float32"}, {"name": "add/y", "shape": [3], "dtype": "float32"}, {"name": "decoder/Conv2d_1/Conv2D_weights", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "decoder/Conv2d_4/Conv2D_bn_offset", "shape": [3], "dtype": "float32"}, {"name": "decoder/Conv2d_1/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "decoder/Conv2d_2/Conv2D_weights", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "decoder/Conv2d_2/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "decoder/Conv2d_3/Conv2D_weights", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "decoder/Conv2d_3/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "decoder/Conv2d_4/Conv2D_weights", "shape": [3, 3, 32, 3], "dtype": "float32"}]}]}